app/views/tasks/create.js.erb

SELECT SUM("tasks"."time") FROM "tasks"
---
// countdown timer
      var cD = <%= Task.sum(:time) %>