app/views/tasks/index.html.erb


          <p style= "position:  relative;top: -867px;left: 46%;">Total Time Needed: <%= Task.sum(:time) %> minutes</p>
---
SELECT SUM("tasks"."time") FROM "tasks"

      //countdown timer
      var cD = <%= Task.sum(:time) %>
---
SELECT SUM("tasks"."time") FROM "tasks"