app/views/tasks/index.html.erb

      //countdown timer
      var cD = <%= Task.sum(:time) %>
---
SELECT SUM("tasks"."time") FROM "tasks"