app/views/tasks/index.html.erb

      <br><br><br><br>
      <p>Total Time Needed: <%= Task.sum(:time) %> minutes</p>
---
SELECT "tasks".* FROM "tasks"
SELECT SUM("tasks"."time") FROM "tasks"

// countdown timer
      var cD = <%= Task.sum(:time) %>
---
SELECT "tasks".* FROM "tasks"
SELECT SUM("tasks"."time") FROM "tasks"