app/controllers/tasks_controller.rb

  def index
    @task = Task.new
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"
SELECT SUM() FROM "tasks"

  def complete
    @task = Task.find(params[:id])
    @task.update(completed_at: Time.zone.now.to_datetime)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "2018-05-11 16:49:11.399818"], ["updated_at", "2018-05-11 16:49:11.401343"], ["id", 13]]

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "your shying away"], ["description", "ill be coming for your love okay"], ["created_at", "2018-05-16 19:10:33.112131"], ["updated_at", "2018-05-16 19:10:33.112131"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Dance in the Rain"], ["updated_at", "2018-05-11 20:32:53.650311"], ["id", 22]]